УТ/src/InformationRegisters/CRM_ЛогиСобытийiCRM/CRM_ЛогиСобытийiCRM.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_ЛогиСобытийiCRM</name>
  <resources>
    <name>ОписаниеСобытия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ТипСобытия</name>
    <type>
      <types>EnumRef.CRM_ТипыСобытийЛогаiCRM</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСобытия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>УзелОбмена</name>
    <type>
      <types>ExchangePlanRef.CRM_СинхронизацияСМобильнымПриложениемНовый</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторСобытия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ/src/Enums/CRM_ТипыСобытийЛогаiCRM/CRM_ТипыСобытийЛогаiCRM.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CRM_ТипыСобытийЛогаiCRM</name>
  <enumValues>
    <name>Информация</name>
  </enumValues>
  <enumValues>
    <name>Предупреждение</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
</mdclass:Enum>

УТ/src/InformationRegisters/CRM_ЛогиСобытийiCRM/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
         Возврат;
    КонецЕсли;
	
	ВестиЛогиiCRM = Истина;
	
	Если НЕ ВестиЛогиiCRM Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		Запись.ДатаСобытия = ТекущаяДатаСеанса();
		Если НЕ ЗначениеЗаполнено(Запись.ТипСобытия) Тогда
			Запись.ТипСобытия = Перечисления.CRM_ТипыСобытийЛогаiCRM.Информация;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Запись.ИдентификаторСобытия) Тогда
			Запись.ИдентификаторСобытия = Новый УникальныйИдентификатор;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
